#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_security_group.staging_server_plancraftr_sg: Refreshing state... [id=sg-03a5dbf88a67c4cda]
aws_instance.staging_server_plancraftr: Refreshing state... [id=i-0dcc1b0054e51e3eb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.staging_api_plancraftr will be created
  + resource "aws_route53_record" "staging_api_plancraftr" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "staging.api.plancraftr.com"
      + records         = [
          + "13.229.105.164",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z097947118UN4SFV6P8TX"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @hasangawr, Action: `pull_request`*